[Survived] BlockStatement
src/controllers/write/topics.js:13:34
 
 const Topics = module.exports;
 
-Topics.get = async (req, res) => {
-	const topicData = await api.topics.get(req, req.params);
-	if (!topicData) {
-		return helpers.formatApiResponse(404, res, new Error('[[error:no-topic]]'));
-	}
-	helpers.formatApiResponse(200, res, topicData);
-};
+Topics.get = async (req, res) => {};
 
 Topics.create = async (req, res) => {

[Survived] ConditionalExpression
src/controllers/write/topics.js:15:6
 
 Topics.get = async (req, res) => {
 	const topicData = await api.topics.get(req, req.params);
-	if (!topicData) {
+	if (true) {
 		return helpers.formatApiResponse(404, res, new Error('[[error:no-topic]]'));
 	}

[Survived] ConditionalExpression
src/controllers/write/topics.js:15:6
 
 Topics.get = async (req, res) => {
 	const topicData = await api.topics.get(req, req.params);
-	if (!topicData) {
+	if (false) {
 		return helpers.formatApiResponse(404, res, new Error('[[error:no-topic]]'));
 	}

[Survived] BlockStatement
src/controllers/write/topics.js:21:37
 	helpers.formatApiResponse(200, res, topicData);
 };
 
-Topics.create = async (req, res) => {
-	const id = await lockPosting(req, '[[error:already-posting]]');
-	try {
-		const payload = await api.topics.create(req, req.body);
-		if (payload.queued) {
-			helpers.formatApiResponse(202, res, payload);
-		} else {
-			helpers.formatApiResponse(200, res, payload);
-		}
-	} finally {
-		await db.deleteObjectField('locks', id);
-	}
-};
+Topics.create = async (req, res) => {};
 
 Topics.reply = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:23:6
 
 Topics.create = async (req, res) => {
 	const id = await lockPosting(req, '[[error:already-posting]]');
-	try {
-		const payload = await api.topics.create(req, req.body);
-		if (payload.queued) {
-			helpers.formatApiResponse(202, res, payload);
-		} else {
-			helpers.formatApiResponse(200, res, payload);
-		}
-	} finally {
+	try {} finally {
 		await db.deleteObjectField('locks', id);
 	}

[Survived] ConditionalExpression
src/controllers/write/topics.js:25:7
 	const id = await lockPosting(req, '[[error:already-posting]]');
 	try {
 		const payload = await api.topics.create(req, req.body);
-		if (payload.queued) {
+		if (true) {
 			helpers.formatApiResponse(202, res, payload);
 		} else {

[Survived] ConditionalExpression
src/controllers/write/topics.js:25:7
 	const id = await lockPosting(req, '[[error:already-posting]]');
 	try {
 		const payload = await api.topics.create(req, req.body);
-		if (payload.queued) {
+		if (false) {
 			helpers.formatApiResponse(202, res, payload);
 		} else {

[Survived] BlockStatement
src/controllers/write/topics.js:27:10
 		const payload = await api.topics.create(req, req.body);
 		if (payload.queued) {
 			helpers.formatApiResponse(202, res, payload);
-		} else {
-			helpers.formatApiResponse(200, res, payload);
-		}
+		} else {}
 	} finally {
 		await db.deleteObjectField('locks', id);

[Survived] BlockStatement
src/controllers/write/topics.js:30:12
 		} else {
 			helpers.formatApiResponse(200, res, payload);
 		}
-	} finally {
-		await db.deleteObjectField('locks', id);
-	}
+	} finally {}
 };
 

[Survived] BlockStatement
src/controllers/write/topics.js:35:36
 	}
 };
 
-Topics.reply = async (req, res) => {
-	const id = await lockPosting(req, '[[error:already-posting]]');
-	try {
-		const payload = await api.topics.reply(req, { ...req.body, tid: req.params.tid });
-		helpers.formatApiResponse(200, res, payload);
-	} finally {
-		await db.deleteObjectField('locks', id);
-	}
-};
+Topics.reply = async (req, res) => {};
 
 async function lockPosting(req, error) {

[Survived] StringLiteral
src/controllers/write/topics.js:36:36
 };
 
 Topics.reply = async (req, res) => {
-	const id = await lockPosting(req, '[[error:already-posting]]');
+	const id = await lockPosting(req, "");
 	try {
 		const payload = await api.topics.reply(req, { ...req.body, tid: req.params.tid });

[Survived] BlockStatement
src/controllers/write/topics.js:37:6
 
 Topics.reply = async (req, res) => {
 	const id = await lockPosting(req, '[[error:already-posting]]');
-	try {
-		const payload = await api.topics.reply(req, { ...req.body, tid: req.params.tid });
-		helpers.formatApiResponse(200, res, payload);
-	} finally {
+	try {} finally {
 		await db.deleteObjectField('locks', id);
 	}

[Survived] ObjectLiteral
src/controllers/write/topics.js:38:47
 Topics.reply = async (req, res) => {
 	const id = await lockPosting(req, '[[error:already-posting]]');
 	try {
-		const payload = await api.topics.reply(req, { ...req.body, tid: req.params.tid });
+		const payload = await api.topics.reply(req, {});
 		helpers.formatApiResponse(200, res, payload);
 	} finally {

[Survived] BlockStatement
src/controllers/write/topics.js:40:12
 	try {
 		const payload = await api.topics.reply(req, { ...req.body, tid: req.params.tid });
 		helpers.formatApiResponse(200, res, payload);
-	} finally {
-		await db.deleteObjectField('locks', id);
-	}
+	} finally {}
 };
 

[Survived] BlockStatement
src/controllers/write/topics.js:45:40
 	}
 };
 
-async function lockPosting(req, error) {
-	const id = req.uid > 0 ? req.uid : req.sessionID;
-	const value = `posting${id}`;
-	const count = await db.incrObjectField('locks', value);
-	if (count > 1) {
-		throw new Error(error);
-	}
-	return value;
-}
+async function lockPosting(req, error) {}
 
 Topics.delete = async (req, res) => {

[Survived] ConditionalExpression
src/controllers/write/topics.js:46:13
 };
 
 async function lockPosting(req, error) {
-	const id = req.uid > 0 ? req.uid : req.sessionID;
+	const id = false ? req.uid : req.sessionID;
 	const value = `posting${id}`;
 	const count = await db.incrObjectField('locks', value);

[Survived] EqualityOperator
src/controllers/write/topics.js:46:13
 };
 
 async function lockPosting(req, error) {
-	const id = req.uid > 0 ? req.uid : req.sessionID;
+	const id = req.uid <= 0 ? req.uid : req.sessionID;
 	const value = `posting${id}`;
 	const count = await db.incrObjectField('locks', value);

[Survived] StringLiteral
src/controllers/write/topics.js:48:41
 async function lockPosting(req, error) {
 	const id = req.uid > 0 ? req.uid : req.sessionID;
 	const value = `posting${id}`;
-	const count = await db.incrObjectField('locks', value);
+	const count = await db.incrObjectField("", value);
 	if (count > 1) {
 		throw new Error(error);

[Survived] ConditionalExpression
src/controllers/write/topics.js:49:6
 	const id = req.uid > 0 ? req.uid : req.sessionID;
 	const value = `posting${id}`;
 	const count = await db.incrObjectField('locks', value);
-	if (count > 1) {
+	if (true) {
 		throw new Error(error);
 	}

[Survived] EqualityOperator
src/controllers/write/topics.js:49:6
 	const id = req.uid > 0 ? req.uid : req.sessionID;
 	const value = `posting${id}`;
 	const count = await db.incrObjectField('locks', value);
-	if (count > 1) {
+	if (count >= 1) {
 		throw new Error(error);
 	}

[Survived] BlockStatement
src/controllers/write/topics.js:55:37
 	return value;
 }
 
-Topics.delete = async (req, res) => {
-	await api.topics.delete(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.delete = async (req, res) => {};
 
 Topics.restore = async (req, res) => {

[Survived] ArrayDeclaration
src/controllers/write/topics.js:56:39
 }
 
 Topics.delete = async (req, res) => {
-	await api.topics.delete(req, { tids: [req.params.tid] });
+	await api.topics.delete(req, { tids: [] });
 	helpers.formatApiResponse(200, res);
 };

[Survived] BlockStatement
src/controllers/write/topics.js:60:38
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.restore = async (req, res) => {
-	await api.topics.restore(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.restore = async (req, res) => {};
 
 Topics.purge = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:61:32
 };
 
 Topics.restore = async (req, res) => {
-	await api.topics.restore(req, { tids: [req.params.tid] });
+	await api.topics.restore(req, {});
 	helpers.formatApiResponse(200, res);
 };

[Survived] BlockStatement
src/controllers/write/topics.js:65:36
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.purge = async (req, res) => {
-	await api.topics.purge(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.purge = async (req, res) => {};
 
 Topics.pin = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:66:30
 };
 
 Topics.purge = async (req, res) => {
-	await api.topics.purge(req, { tids: [req.params.tid] });
+	await api.topics.purge(req, {});
 	helpers.formatApiResponse(200, res);
 };

[Survived] ArrayDeclaration
src/controllers/write/topics.js:66:38
 };
 
 Topics.purge = async (req, res) => {
-	await api.topics.purge(req, { tids: [req.params.tid] });
+	await api.topics.purge(req, { tids: [] });
 	helpers.formatApiResponse(200, res);
 };

[Survived] BlockStatement
src/controllers/write/topics.js:70:34
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.pin = async (req, res) => {
-	const { expiry } = req.body;
-	await api.topics.pin(req, { tids: [req.params.tid], expiry });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.pin = async (req, res) => {};
 
 Topics.unpin = async (req, res) => {

[Survived] ArrayDeclaration
src/controllers/write/topics.js:72:36
 
 Topics.pin = async (req, res) => {
 	const { expiry } = req.body;
-	await api.topics.pin(req, { tids: [req.params.tid], expiry });
+	await api.topics.pin(req, { tids: [], expiry });
 
 	helpers.formatApiResponse(200, res);

[Survived] BlockStatement
src/controllers/write/topics.js:77:36
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.unpin = async (req, res) => {
-	await api.topics.unpin(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.unpin = async (req, res) => {};
 
 Topics.lock = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:78:30
 };
 
 Topics.unpin = async (req, res) => {
-	await api.topics.unpin(req, { tids: [req.params.tid] });
+	await api.topics.unpin(req, {});
 	helpers.formatApiResponse(200, res);
 };

[Survived] BlockStatement
src/controllers/write/topics.js:82:35
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.lock = async (req, res) => {
-	await api.topics.lock(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.lock = async (req, res) => {};
 
 Topics.unlock = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:87:37
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.unlock = async (req, res) => {
-	await api.topics.unlock(req, { tids: [req.params.tid] });
-	helpers.formatApiResponse(200, res);
-};
+Topics.unlock = async (req, res) => {};
 
 Topics.follow = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:92:37
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.follow = async (req, res) => {
-	await api.topics.follow(req, req.params);
-	helpers.formatApiResponse(200, res);
-};
+Topics.follow = async (req, res) => {};
 
 Topics.ignore = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:97:37
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.ignore = async (req, res) => {
-	await api.topics.ignore(req, req.params);
-	helpers.formatApiResponse(200, res);
-};
+Topics.ignore = async (req, res) => {};
 
 Topics.unfollow = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:102:39
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.unfollow = async (req, res) => {
-	await api.topics.unfollow(req, req.params);
-	helpers.formatApiResponse(200, res);
-};
+Topics.unfollow = async (req, res) => {};
 
 Topics.updateTags = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:107:41
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.updateTags = async (req, res) => {
-	const payload = await api.topics.updateTags(req, {
-		tid: req.params.tid,
-		tags: req.body.tags,
-	});
-	helpers.formatApiResponse(200, res, payload);
-};
+Topics.updateTags = async (req, res) => {};
 
 Topics.addTags = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:115:38
 	helpers.formatApiResponse(200, res, payload);
 };
 
-Topics.addTags = async (req, res) => {
-	const payload = await api.topics.addTags(req, {
-		tid: req.params.tid,
-		tags: req.body.tags,
-	});
-
-	helpers.formatApiResponse(200, res, payload);
-};
+Topics.addTags = async (req, res) => {};
 
 Topics.deleteTags = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:124:41
 	helpers.formatApiResponse(200, res, payload);
 };
 
-Topics.deleteTags = async (req, res) => {
-	await api.topics.deleteTags(req, { tid: req.params.tid });
-	helpers.formatApiResponse(200, res);
-};
+Topics.deleteTags = async (req, res) => {};
 
 Topics.getThumbs = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:125:35
 };
 
 Topics.deleteTags = async (req, res) => {
-	await api.topics.deleteTags(req, { tid: req.params.tid });
+	await api.topics.deleteTags(req, {});
 	helpers.formatApiResponse(200, res);
 };

[Survived] BlockStatement
src/controllers/write/topics.js:129:40
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.getThumbs = async (req, res) => {
-	let { thumbsOnly } = req.query;
-	thumbsOnly = thumbsOnly ? !!parseInt(thumbsOnly, 10) : false;
-	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { ...req.params, thumbsOnly }));
-};
+Topics.getThumbs = async (req, res) => {};
 
 Topics.addThumb = async (req, res) => {

[Survived] BooleanLiteral
src/controllers/write/topics.js:131:57
 
 Topics.getThumbs = async (req, res) => {
 	let { thumbsOnly } = req.query;
-	thumbsOnly = thumbsOnly ? !!parseInt(thumbsOnly, 10) : false;
+	thumbsOnly = thumbsOnly ? !!parseInt(thumbsOnly, 10) : true;
 	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { ...req.params, thumbsOnly }));
 };

[Survived] BooleanLiteral
src/controllers/write/topics.js:131:28
 
 Topics.getThumbs = async (req, res) => {
 	let { thumbsOnly } = req.query;
-	thumbsOnly = thumbsOnly ? !!parseInt(thumbsOnly, 10) : false;
+	thumbsOnly = thumbsOnly ? !parseInt(thumbsOnly, 10) : false;
 	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { ...req.params, thumbsOnly }));
 };

[Survived] BlockStatement
src/controllers/write/topics.js:135:39
 	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { ...req.params, thumbsOnly }));
 };
 
-Topics.addThumb = async (req, res) => {
-	// todo: move controller logic to src/api/topics.js
-	await api.topics._checkThumbPrivileges({ tid: req.params.tid, uid: req.user.uid });
-
-	const files = await uploadsController.uploadThumb(req, res); // response is handled here
-
-	// Add uploaded files to topic zset
-	if (files && files.length) {
-		await Promise.all(files.map(async (fileObj) => {
-			await topics.thumbs.associate({
-				id: req.params.tid,
-				path: fileObj.url,
-			});
-		}));
-	}
-};
+Topics.addThumb = async (req, res) => {};
 
 Topics.migrateThumbs = async (req, res) => {

[Survived] ConditionalExpression
src/controllers/write/topics.js:142:6
 	const files = await uploadsController.uploadThumb(req, res); // response is handled here
 
 	// Add uploaded files to topic zset
-	if (files && files.length) {
+	if (true) {
 		await Promise.all(files.map(async (fileObj) => {
 			await topics.thumbs.associate({

[Survived] ConditionalExpression
src/controllers/write/topics.js:142:6
 	const files = await uploadsController.uploadThumb(req, res); // response is handled here
 
 	// Add uploaded files to topic zset
-	if (files && files.length) {
+	if (false) {
 		await Promise.all(files.map(async (fileObj) => {
 			await topics.thumbs.associate({

[Survived] BlockStatement
src/controllers/write/topics.js:143:50
 
 	// Add uploaded files to topic zset
 	if (files && files.length) {
-		await Promise.all(files.map(async (fileObj) => {
-			await topics.thumbs.associate({
-				id: req.params.tid,
-				path: fileObj.url,
-			});
-		}));
+		await Promise.all(files.map(async (fileObj) => {}));
 	}
 };

[Survived] ObjectLiteral
src/controllers/write/topics.js:144:34
 	// Add uploaded files to topic zset
 	if (files && files.length) {
 		await Promise.all(files.map(async (fileObj) => {
-			await topics.thumbs.associate({
-				id: req.params.tid,
-				path: fileObj.url,
-			});
+			await topics.thumbs.associate({});
 		}));
 	}

[Survived] BlockStatement
src/controllers/write/topics.js:152:44
 	}
 };
 
-Topics.migrateThumbs = async (req, res) => {
-	await api.topics.migrateThumbs(req, {
-		from: req.params.tid,
-		to: req.body.tid,
-	});
-
-	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { tid: req.body.tid }));
-};
+Topics.migrateThumbs = async (req, res) => {};
 
 Topics.deleteThumb = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:158:70
 		to: req.body.tid,
 	});
 
-	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { tid: req.body.tid }));
+	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, {}));
 };
 

[Survived] BlockStatement
src/controllers/write/topics.js:161:42
 	helpers.formatApiResponse(200, res, await api.topics.getThumbs(req, { tid: req.body.tid }));
 };
 
-Topics.deleteThumb = async (req, res) => {
-	if (!req.body.path.startsWith('http')) {
-		await middleware.assert.path(req, res, () => {});
-		if (res.headersSent) {
-			return;
-		}
-	}
-
-	await api.topics.deleteThumb(req, {
-		tid: req.params.tid,
-		path: req.body.path,
-	});
-	helpers.formatApiResponse(200, res, await topics.thumbs.get(req.params.tid));
-};
+Topics.deleteThumb = async (req, res) => {};
 
 Topics.reorderThumbs = async (req, res) => {

[Survived] ConditionalExpression
src/controllers/write/topics.js:162:6
 };
 
 Topics.deleteThumb = async (req, res) => {
-	if (!req.body.path.startsWith('http')) {
+	if (true) {
 		await middleware.assert.path(req, res, () => {});
 		if (res.headersSent) {

[Survived] MethodExpression
src/controllers/write/topics.js:162:7
 };
 
 Topics.deleteThumb = async (req, res) => {
-	if (!req.body.path.startsWith('http')) {
+	if (!req.body.path.endsWith('http')) {
 		await middleware.assert.path(req, res, () => {});
 		if (res.headersSent) {

[Survived] BlockStatement
src/controllers/write/topics.js:164:24
 Topics.deleteThumb = async (req, res) => {
 	if (!req.body.path.startsWith('http')) {
 		await middleware.assert.path(req, res, () => {});
-		if (res.headersSent) {
-			return;
-		}
+		if (res.headersSent) {}
 	}
 

[Survived] ConditionalExpression
src/controllers/write/topics.js:164:7
 Topics.deleteThumb = async (req, res) => {
 	if (!req.body.path.startsWith('http')) {
 		await middleware.assert.path(req, res, () => {});
-		if (res.headersSent) {
+		if (false) {
 			return;
 		}

[Survived] BlockStatement
src/controllers/write/topics.js:176:44
 	helpers.formatApiResponse(200, res, await topics.thumbs.get(req.params.tid));
 };
 
-Topics.reorderThumbs = async (req, res) => {
-	const { path, order } = req.body;
-	await api.topics.reorderThumbs(req, {
-		path,
-		order,
-		...req.params,
-	});
-
-	helpers.formatApiResponse(200, res, await topics.thumbs.get(req.params.tid));
-};
+Topics.reorderThumbs = async (req, res) => {};
 
 Topics.getEvents = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:187:40
 	helpers.formatApiResponse(200, res, await topics.thumbs.get(req.params.tid));
 };
 
-Topics.getEvents = async (req, res) => {
-	const events = await api.topics.getEvents(req, { ...req.params });
-
-	helpers.formatApiResponse(200, res, { events });
-};
+Topics.getEvents = async (req, res) => {};
 
 Topics.deleteEvent = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:193:42
 	helpers.formatApiResponse(200, res, { events });
 };
 
-Topics.deleteEvent = async (req, res) => {
-	await api.topics.deleteEvent(req, { ...req.params });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.deleteEvent = async (req, res) => {};
 
 Topics.markRead = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:199:39
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.markRead = async (req, res) => {
-	await api.topics.markRead(req, { ...req.params });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.markRead = async (req, res) => {};
 
 Topics.markUnread = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:205:41
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.markUnread = async (req, res) => {
-	await api.topics.markUnread(req, { ...req.params });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.markUnread = async (req, res) => {};
 
 Topics.bump = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:211:35
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.bump = async (req, res) => {
-	await api.topics.bump(req, { ...req.params });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.bump = async (req, res) => {};
 
 Topics.move = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:217:35
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.move = async (req, res) => {
-	const { cid } = req.body;
-	await api.topics.move(req, { cid, ...req.params });
-
-	helpers.formatApiResponse(200, res);
-};
+Topics.move = async (req, res) => {};
 
 Topics.userPin = async (req, res) => {

[Survived] ObjectLiteral
src/controllers/write/topics.js:219:29
 
 Topics.move = async (req, res) => {
 	const { cid } = req.body;
-	await api.topics.move(req, { cid, ...req.params });
+	await api.topics.move(req, {});
 
 	helpers.formatApiResponse(200, res);

[Survived] BlockStatement
src/controllers/write/topics.js:224:38
 	helpers.formatApiResponse(200, res);
 };
 
-Topics.userPin = async (req, res) => {
-	const payload = await api.topics.userPin(req, { pid: req.params.pid });
-	helpers.formatApiResponse(200, res, payload);
-};
+Topics.userPin = async (req, res) => {};
 
 Topics.userUnpin = async (req, res) => {

[Survived] BlockStatement
src/controllers/write/topics.js:229:40
 	helpers.formatApiResponse(200, res, payload);
 };
 
-Topics.userUnpin = async (req, res) => {
-	const payload = await api.topics.userUnpin(req, { pid: req.params.pid });
-	helpers.formatApiResponse(200, res, payload);
-};
+Topics.userUnpin = async (req, res) => {};
 
